/*============================================================================================
 *
 *  (C) 2010, Phyton
 *
 *  Демонстрационный проект для 1986BE91 testboard
 *
 *  Данное ПО предоставляется "КАК ЕСТЬ", т.е. исключительно как пример, призванный облегчить
 *  пользователям разработку их приложений для процессоров Milandr 1986BE91T1. Компания Phyton
 *  не несет никакой ответственности за возможные последствия использования данного, или
 *  разработанного пользователем на его основе, ПО.
 *
 *--------------------------------------------------------------------------------------------
 *
 *  Файл leds.c: Работа со светодиодами
 *
 *============================================================================================*/

#include "leds.h"
#include "lcd.h"
#include "text.h"
#include "joystick.h"
#include "menu.h"

/* Маска включенных светодиодов */
u32 CurrentLights;

/* Сервисные утилиты */

void InitPortLED(void) {
    PORTD->FUNC &= ~((0x3FF << (LED0_OFS << 1)));   /* Port */
    PORTD->ANALOG |= LEDS_MASK;                     /* Digital */
    PORTD->PWR |= (0x155 << (LED0_OFS << 1));       /* Slow */
    PORTD->RXTX &= ~LEDS_MASK;
    PORTD->OE |= LEDS_MASK;
}

void ShiftLights(void) {
    u32 ovf;
    PORTD->RXTX = (PORTD->RXTX & ~LEDS_MASK) | (CurrentLights & LEDS_MASK);
    ovf = (CurrentLights & (1UL << 31)) != 0;
    CurrentLights <<= 1;
    CurrentLights |= ovf;
}

/*============================================================================================
 * Конец файла leds.c
 *============================================================================================*/

