/*============================================================================================
 *
 *  (C) 2010, Phyton
 *
 *  Демонстрационный проект для 1986BE91 testboard
 *
 *  Данное ПО предоставляется "КАК ЕСТЬ", т.е. исключительно как пример, призванный облегчить 
 *  пользователям разработку их приложений для процессоров Milandr 1986BE91T1. Компания Phyton 
 *  не несет никакой ответственности за возможные последствия использования данного, или 
 *  разработанного пользователем на его основе, ПО.
 *
 *--------------------------------------------------------------------------------------------
 *
 *  Файл analog.h: Работа со АЦП,ЦАП и так далее
 *
 *============================================================================================*/

#ifndef __TMRS_H
#define __TMRS_H

#include "types.h"

/* Сервисные утилиты */

void InitPWM(void);


#endif /* __LEDS_H */

/*============================================================================================
 * Конец файла analog.h
 *============================================================================================*/
